data/jmeter/Project.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">50</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">10</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request - Player Snapshot" enabled="true">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.path">/lol/player-snapshots</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;source_id&quot;: &quot;${__UUID()}&quot;,&#xd;
  &quot;sent_timestamp&quot;: &quot;${__time(yyyy-MM-dd&apos;T&apos;HH:mm:ss&apos;Z&apos;,)}&quot;,&#xd;
  &quot;match_id&quot;: &quot;NA1_${__Random(1000000000,9999999999)}&quot;,&#xd;
  &quot;region&quot;: &quot;NA&quot;,&#xd;
  &quot;snapshots&quot;: [&#xd;
    {&#xd;
      &quot;player_puuid&quot;: &quot;${__UUID()}&quot;,&#xd;
      &quot;game_time_seconds&quot;: ${__Random(1200,2000,)},&#xd;
      &quot;kills&quot;: ${__Random(0,20,)},&#xd;
      &quot;deaths&quot;: ${__Random(0,20,)},&#xd;
      &quot;assists&quot;: ${__Random(0,30,)},&#xd;
      &quot;cs&quot;: ${__Random(100,300,)},&#xd;
      &quot;gold&quot;: ${__Random(800,20000,)},&#xd;
      &quot;lane&quot;: &quot;TOP&quot;&#xd;
    },&#xd;
    {&#xd;
      &quot;player_puuid&quot;: &quot;${__UUID()}&quot;,&#xd;
      &quot;game_time_seconds&quot;: ${__Random(1200,2000,)},&#xd;
      &quot;kills&quot;: ${__Random(0,20,)},&#xd;
      &quot;deaths&quot;: ${__Random(0,20,)},&#xd;
      &quot;assists&quot;: ${__Random(0,30,)},&#xd;
      &quot;cs&quot;: ${__Random(100,300,)},&#xd;
      &quot;gold&quot;: ${__Random(800,20000,)},&#xd;
      &quot;lane&quot;: &quot;MID&quot;&#xd;
    }&#xd;
  ]&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request - Match Event" enabled="true">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.path">/lol/match-events</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;source_id&quot;: &quot;${__UUID()}&quot;,&#xd;
  &quot;sent_timestamp&quot;: &quot;${__time(yyyy-MM-dd&apos;T&apos;HH:mm:ss&apos;Z&apos;)}&quot;,&#xd;
  &quot;match_id&quot;: &quot;NA1_${__Random(1000000000,9999999999)}&quot;,&#xd;
  &quot;events&quot;: [&#xd;
    {&#xd;
      &quot;event_type&quot;: &quot;DRAGON&quot;,&#xd;
      &quot;game_time_seconds&quot;: ${__Random(1200,2500)},&#xd;
      &quot;team_id&quot;: 100,&#xd;
      &quot;x&quot;: ${__Random(0,150)},&#xd;
      &quot;y&quot;: ${__Random(0,150)}&#xd;
    },&#xd;
    {&#xd;
      &quot;event_type&quot;: &quot;TOWER&quot;,&#xd;
      &quot;game_time_seconds&quot;: ${__Random(1200,2500)},&#xd;
      &quot;team_id&quot;: 200,&#xd;
      &quot;x&quot;: ${__Random(0,150)},&#xd;
      &quot;y&quot;: ${__Random(0,150)}&#xd;
    }&#xd;
  ]&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>